In [1]:
import numpy as np
import pandas as pd

In [2]:
pwd

'C:\\Users\\Ketan Gangal\\OneDrive\\Desktop\\python_basic\\Untitled Folder\\Pandas_work'

In [20]:
myser = pd.Series(['Nov 3, 2000', '2000-01-01', np.nan])

In [21]:
myser

0    Nov 3, 2000
1     2000-01-01
2            NaN
dtype: object

In [7]:
# pd.to_datetime() which makes python to think strings as dates convert them into time stamp

In [24]:
data = pd.to_datetime(myser)
'''if you add your data frame 
in this to_data it will create 
datetime obj on which you can perform datatime mtd and attribute calls'''
data

0   2000-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [25]:
data.dt.year

0    2000.0
1    2000.0
2       NaN
dtype: float64

In [26]:
data.dt.day

0    3.0
1    1.0
2    NaN
dtype: float64

In [28]:
data.dt.is_leap_year

0     True
1     True
2    False
dtype: bool

In [29]:
obvi_euro_date = '31-12-2000'  
# pandas is developed by american developer so it takes 
# format like month - date - year 
# here it is 31 is date coz there is only 12 months so it can do that

In [30]:
euro_date = '10-12-2000'

In [31]:
pd.to_datetime(obvi_euro_date) # see

Timestamp('2000-12-31 00:00:00')

In [32]:
pd.to_datetime(euro_date) # but here it gets confuse to resolve this use dayfirst

Timestamp('2000-10-12 00:00:00')

In [34]:
euro_date = '10-12-2000'
pd.to_datetime(euro_date,dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [35]:
# if you get different styles then different styles use format in to_date

In [36]:
date = '12---nov--$2000'

In [37]:
pd.to_datetime(date,format='%d---%b--$%Y')

Timestamp('2000-11-12 00:00:00')

In [42]:
date = '12th of dec 2000'

In [43]:
pd.to_datetime(date)

Timestamp('2000-12-12 00:00:00')

In [44]:
pwd

'C:\\Users\\Ketan Gangal\\OneDrive\\Desktop\\python_basic\\Untitled Folder\\Pandas_work'

In [45]:
df = pd.read_csv('C:\\Users\\Ketan Gangal\\OneDrive\\Desktop\\python_basic\\Untitled Folder\\machine_learning\\Data\\RetailSales_BeerWineLiquor.csv')

In [48]:
df.head()

         DATE  MRTSSM4453USN
0  1992-01-01           1509
1  1992-02-01           1541
2  1992-03-01           1597
3  1992-04-01           1675
4  1992-05-01           1822

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    object
 1   MRTSSM4453USN  340 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.4+ KB

In [50]:
df['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [51]:
df['DATE'] = pd.to_datetime(df['DATE'])

In [53]:
df['DATE'].head() # converted into date time

0   1992-01-01
1   1992-02-01
2   1992-03-01
3   1992-04-01
4   1992-05-01
Name: DATE, dtype: datetime64[ns]

In [54]:
df

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [57]:
df['DATE'][0].year

1992

In [59]:
def date(dat):
    return dat.year

In [61]:
df['DATE'].apply(date)

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
335    2019
336    2020
337    2020
338    2020
339    2020
Name: DATE, Length: 340, dtype: int64

In [62]:
# we can convert datetime at the start by 
#using parse_date=[column index] at the time of csv reading

In [63]:
df = pd.read_csv('C:\\Users\\Ketan Gangal\\OneDrive\\Desktop\\python_basic\\Untitled Folder\\machine_learning\\Data\\RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [65]:
df['DATE'].head()

0   1992-01-01
1   1992-02-01
2   1992-03-01
3   1992-04-01
4   1992-05-01
Name: DATE, dtype: datetime64[ns]

In [66]:
# resample == groupby for time stamp

In [67]:
df.head()

        DATE  MRTSSM4453USN
0 1992-01-01           1509
1 1992-02-01           1541
2 1992-03-01           1597
3 1992-04-01           1675
4 1992-05-01           1822

In [68]:
df = df.set_index('DATE')

In [69]:
df.head()

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822

In [73]:
df.resample(rule='A').mean().head() # rules can be found on notebook or pandas official documents

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000